org/20211202104804-what_i_am_working_on.org
:PROPERTIES:
:ID:       9980ae28-68d4-4e29-9248-d661ccd85ab8
:END:
#+title: 💻 Working on now
#+filetags: :public:

I am lucky to enjoy what I am doin. So naturally, work and my personal projects (open source) keep me very busy. But I am also trying to [[id:058ec62c-6022-4eeb-b0a0-e88a75a8b761][do other things with my life]].

* I implement [[id:5acc4f0f-417e-424f-95a5-1c95e7e822ff][MCMC]] samplers

[[https://github.com/blackjax-devs/blackjax][Blackjax]] is approaching v1, and will go through API consolidation soon. I have to admit I particulatly enjoy tweaking APIs until they feel "natural" (to everyone, not just until I am used to it). We are seeing more applications of =blackjax= to deep learning, and looking forward to examples that distribute gradient computations.

* I build a framework that builds MCMC samplers from models

[[https://github.com/aesara-devs/aemcmc][AeMCMC]] uses [[id:f4cf39be-6c6a-4a9d-804a-3879a98177bc][miniKanren]] to match models with the samplers that is most appropriate, and reparametrize models automatically.

* I analyze [[https://github.com/pollsposition][Politics with statistics]]

[[id:51550685-38f7-4cbd-8fd4-bd0c5c293c04][Pollsposition]] uses bayesian statistics and data that we [[https://github.com/pollsposition/data][collect manually]] to analyze (and predict) political trends. I am currently building a model to [[file:blog/drafts/presidentielles-report-voix.org][infer vote transfers]] between the first and second round of the presidential elections. I am also re-implementing all my models to use [[id:5a5e87b1-558c-43db-ad38-32a073b10351][Aesara]], and write an introdution to our models.

* I dabble in relatonal programming

I am trying to understand relational programming, and contribute to the python ecosystem. I am well into [[id:f4cf39be-6c6a-4a9d-804a-3879a98177bc][miniKanren]] at the moment.


* Interests

- [[id:bf925a86-18be-4845-ad88-063a28f359f4][Democracy]]
- [[id:1a53642d-c03e-4ae9-92e2-e164869927b3][The monetary system]]
