20211202104804-what_i_am_working_on.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>💻 Working on now</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">💻 Working on now</h1>
<p>
I am lucky to enjoy what I am doin. So naturally, work and my personal projects (open source) keep me very busy. But I am also trying to <a href="now.html#ID-058ec62c-6022-4eeb-b0a0-e88a75a8b761">do other things with my life</a>.
</p>

<div id="outline-container-org942ad7b" class="outline-2">
<h2 id="org942ad7b">I implement <a href="20220306194751-markov_chain_monte_carlo_new.html#ID-5acc4f0f-417e-424f-95a5-1c95e7e822ff">MCMC</a> samplers</h2>
<div class="outline-text-2" id="text-org942ad7b">
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/blackjax-devs/blackjax">Blackjax</a> is approaching v1, and will go through API consolidation soon. I have to admit I particulatly enjoy tweaking APIs until they feel "natural" (to everyone, not just until I am used to it). We are seeing more applications of <code>blackjax</code> to deep learning, and looking forward to examples that distribute gradient computations.
</p>
</div>
</div>

<div id="outline-container-org1dcba06" class="outline-2">
<h2 id="org1dcba06">I build a framework that builds MCMC samplers from models</h2>
<div class="outline-text-2" id="text-org1dcba06">
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aemcmc">AeMCMC</a> uses <a href="20220804135950-minikanren.html#ID-f4cf39be-6c6a-4a9d-804a-3879a98177bc">miniKanren</a> to match models with the samplers that is most appropriate, and reparametrize models automatically.
</p>
</div>
</div>

<div id="outline-container-orgc9ab83a" class="outline-2">
<h2 id="orgc9ab83a">I analyze <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pollsposition">Politics with statistics</a></h2>
<div class="outline-text-2" id="text-orgc9ab83a">
<p>
<a href="20211126110607-pollsposition.html#ID-51550685-38f7-4cbd-8fd4-bd0c5c293c04">Pollsposition</a> uses bayesian statistics and data that we <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pollsposition/data">collect manually</a> to analyze (and predict) political trends. I am currently building a model to <a href="blog/drafts/presidentielles-report-voix.html">infer vote transfers</a> between the first and second round of the presidential elections. I am also re-implementing all my models to use <a href="20220729163627-aesara.html#ID-5a5e87b1-558c-43db-ad38-32a073b10351">Aesara</a>, and write an introdution to our models.
</p>
</div>
</div>

<div id="outline-container-org47f1e48" class="outline-2">
<h2 id="org47f1e48">I dabble in relatonal programming</h2>
<div class="outline-text-2" id="text-org47f1e48">
<p>
I am trying to understand relational programming, and contribute to the python ecosystem. I am well into <a href="20220804135950-minikanren.html#ID-f4cf39be-6c6a-4a9d-804a-3879a98177bc">miniKanren</a> at the moment.
</p>
</div>
</div>


<div id="outline-container-org59833e1" class="outline-2">
<h2 id="org59833e1">Interests</h2>
<div class="outline-text-2" id="text-org59833e1">
<ul class="org-ul">
<li><a href="20220306175155-democracy.html#ID-bf925a86-18be-4845-ad88-063a28f359f4">Democracy</a></li>
<li><a href="20220103155222-monetary_systems.html#ID-1a53642d-c03e-4ae9-92e2-e164869927b3">The monetary system</a></li>
</ul>
</div>
</div>

<div id="outline-container-org99f4200" class="outline-2">
<h2 id="org99f4200">Links to this note</h2>
<div class="outline-text-2" id="text-org99f4200">
<ul class="org-ul">
<li><a href="./20220406085251-automate_decisions_about_what_to_work_on.html">Choose what to work on</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
